<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Intro to Python: Pandas
Week 2 | Day 2

---

### LEARNING OBJECTIVES

- Read a csv file using pandas
- Viewing data: head, columns, values, describe
- Selection: a single column, slicing by row, by position
- Perform boolean indexing on dataframes
- Inspect data types
- Clean up a column using df.apply()
- Know what situations to use .value_counts() in your code

<a name="Series and DataFrame data types"></a>
## Introduction: Series and DataFrame data types (10 mins)

- Series is a one-dimensional labeled array capable of holding any data type (integers, strings,
floating point numbers, Python objects, etc.). The axis labels are collectively referred to as
the index. The basic method to create a Series is to call:

```Python
s = pd.Series(data, index=index)
```

- Here, data can be many different things:
    - a Python dict
    - an ndarray
    - a scalar value (like 5)

- The passed index is a list of axis labels.



- DataFrame is a 2-dimensional labeled data structure with columns of potentially
different types. You can think of it like a spreadsheet or SQL table, or a dict
of Series objects. It is generally the most commonly used pandas object.

- Like Series, DataFrame accepts many different kinds of input:
    - Dict of 1D ndarrays, lists, dicts, or Series
    - 2-D numpy.ndarray
    - Structured or record ndarray
    - A Series
    - Another DataFrame

- Along with the data, you can optionally pass index (row labels) and columns
(column labels) arguments. If you pass an index and / or columns, you are
guaranteeing the index and / or columns of the resulting DataFrame. Thus, a dict
of Series plus a specific index will discard all data not matching up to the
passed index.

- If axis labels are not passed, they will be constructed from the input data based on common sense rules.

Here is more information on [series and dataframes](http://pandas.pydata.org/pandas-docs/stable/dsintro.html).

**Check:** What are some differences between Series and DataFrame?

<a name="pd.Series"></a>
## Demo / Guided Practice: pd.Series (25 mins)

Let's create a series and see what `pandas.Series` can do.

In [31]:
import pandas as pd
import numpy as np

In [32]:
# create a series using a numpy random number generator
s = pd.Series(np.random.randint(0, 25, 7), index=list("abcdefg"))
s

a    15
b    10
c    17
d     2
e    24
f    15
g    10
dtype: int32


Now we have a series of 7 random numbers. Let's try out the same things we did with
a data frame back in W2 L1.1. First, let's look at the series head.

In [33]:
# head of series
s.head()

a    15
b    10
c    17
d     2
e    24
dtype: int32

<details>
    <summary>Solution</summary>
    <code>s.head()</code>
</details>

In [34]:
# tail of series
s.tail()

c    17
d     2
e    24
f    15
g    10
dtype: int32

In [35]:
# summary stats
s.describe()

count     7.000000
mean     13.285714
std       6.872998
min       2.000000
25%      10.000000
50%      15.000000
75%      16.000000
max      24.000000
dtype: float64

In [36]:
# select by location c to g
s["c":"g"]

c    17
d     2
e    24
f    15
g    10
dtype: int32

In [37]:
# select just b
s["b"]

10

In [38]:
# slice for rows 1-3
s[1:4]

b    10
c    17
d     2
dtype: int32

**Check:** How would you select just 'd'?

<a name="Boolean indexing"></a>
## Demo / Guided Practice: Boolean indexing (25 mins)

Another common operation is the use of boolean vectors to filter the data. The operators
are: | for or, & for and, and ~ for not. These must be grouped by using parentheses.

Let's create another series and use pandas to do some Boolean indexing.

In [39]:
# create another series ranging from -3 to 3

s = pd.Series(range(-3, 4))
s

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
dtype: int64

In [40]:
# find the values that are > 0. 
s[s > 0]

4    1
5    2
6    3
dtype: int64

In [41]:
# find the values that are < -1 or > 0.5
mask = (s < -1) | (s > 0.5)
s[mask]

0   -3
1   -2
4    1
5    2
6    3
dtype: int64

In [42]:
# find the values that are not < 0.
s[~(s < 0)]

3    0
4    1
5    2
6    3
dtype: int64

Here is some further information on [boolean indexing](http://pandas.pydata.org/pandas-docs/stable/indexing.html#slicing-ranges).

**Check:** How would you find all the numbers that are < 2?

In [43]:
# find the values that are < 2
s[s < 2]

0   -3
1   -2
2   -1
3    0
4    1
dtype: int64

**Check:** This looks familiar...didn't we already learn how to read in csv files?
Yes, but that was using Python without any libraries or packages. It took 5 lines of
Python, but using Pandas it only takes one line. Nice!

<a name="Viewing data: head/tail, describe"></a>
## Demo / Guided Practice: `pd.DataFrame` Viewing data: head/tail, describe (25 mins)

In [44]:
# read in csv file and create a pandas dataframe
data = pd.read_csv("sales.csv")
data

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented
17,123456,cosmos,neil,lucy,universe,1,"1,000,000",presented

In [45]:
# head of dataset
data.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [46]:
# tail of dataset
data.tail()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented
17,123456,cosmos,neil,lucy,universe,1,"1,000,000",presented

**Check:** What can looking at the head and tail of a dataset tell us?

In [48]:
# summary stats
# data.describe()
data.describe(include="all")

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
count,18.000000,18,18,18,18,18.000000,18,18
unique,NaN,13,6,3,5,NaN,9,4
top,NaN,Trantow-Barrows,Craig Booker,Debra Henley,CPU,NaN,5000,presented
freq,NaN,3,4,9,9,NaN,4,7
mean,443432.111111,NaN,NaN,NaN,NaN,1.722222,NaN,NaN
std,263737.607563,NaN,NaN,NaN,NaN,1.017815,NaN,NaN
min,123456.000000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
25%,218895.000000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
50%,359944.500000,NaN,NaN,NaN,NaN,1.500000,NaN,NaN
75%,714466.000000,NaN,NaN,NaN,NaN,2.000000,NaN,NaN
max,740150.000000,NaN,NaN,NaN,NaN,5.000000,NaN,NaN

This gives us: count, mean, std, min, 25%, 50%, 75%, and max. Awesome!

**Check:** What was the cautionary tale about relying too heavily on summary stats again?


<a name="Selection: a single column, slicing by row, by position"></a>
## Demo / Guided Practice: Selection: a single column, slicing by row, by position (25 mins)

In [50]:
# select a single column
# data["Name"]
data.Name

0                  Trantow-Barrows
1                  Trantow-Barrows
2                  Trantow-Barrows
3     Fritsch, Russel and Anderson
4                     Kiehn-Spinka
5                        Kulas Inc
6                        Kulas Inc
7                    Jerde-Hilpert
8                       Barton LLC
9                       Herman LLC
10                     Purdy-Kunde
11                      Stokes LLC
12                      Stokes LLC
13     Kassulke, Ondricka and Metz
14                     Keeling LLC
15                       Koepp Ltd
16                       Koepp Ltd
17                          cosmos
Name: Name, dtype: object

**Check:** How would you select the 'Quantity' and 'Price' columns separately?

In [51]:
data[["Quantity", "Price"]]

    Quantity      Price
0          1      30000
1          1      10000
2          2       5000
3          1      35000
4          2      65000
5          2      40000
6          1      10000
7          2       5000
8          1      35000
9          2      65000
10         1      30000
11         1       5000
12         1      10000
13         3       7000
14         5     100000
15         2      65000
16         2       5000
17         1  1,000,000

In [54]:
# slice certain rows 
data[5:10]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won

**Check:** How would you slice for rows 9 to 14?

In [55]:
# slice for rows 9-14
data[9:14]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won

#### Now, let's try selecting by position.

In [56]:
# First, let's slice some rows.
data.iloc[9:14]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won

**Check:** How would you slice for rows 9 to 14?

In [57]:
# slice some columns
data.iloc[:, 2:5]

              Rep        Manager      Product
0    Craig Booker   Debra Henley          CPU
1    Craig Booker   Debra Henley     Software
2    Craig Booker   Debra Henley  Maintenance
3    Craig Booker   Debra Henley          CPU
4   Daniel Hilton   Debra Henley          CPU
5   Daniel Hilton   Debra Henley          CPU
6   Daniel Hilton   Debra Henley     Software
7      John Smith   Debra Henley  Maintenance
8      John Smith   Debra Henley          CPU
9     Cedric Moss  Fred Anderson          CPU
10    Cedric Moss  Fred Anderson          CPU
11    Cedric Moss  Fred Anderson  Maintenance
12    Cedric Moss  Fred Anderson     Software
13     Wendy Yule  Fred Anderson  Maintenance
14     Wendy Yule  Fred Anderson          CPU
15     Wendy Yule  Fred Anderson          CPU
16     Wendy Yule  Fred Anderson      Monitor
17           neil           lucy     universe

**Check:** How would you slice for the 'Manager' and 'Product' columns?

In [58]:
# slice for the 'manager' column
data.iloc[:, 3]

0      Debra Henley
1      Debra Henley
2      Debra Henley
3      Debra Henley
4      Debra Henley
5      Debra Henley
6      Debra Henley
7      Debra Henley
8      Debra Henley
9     Fred Anderson
10    Fred Anderson
11    Fred Anderson
12    Fred Anderson
13    Fred Anderson
14    Fred Anderson
15    Fred Anderson
16    Fred Anderson
17             lucy
Name: Manager, dtype: object

In [59]:
# select for an explicit value only
data.iloc[0, 0]

714466

<a name="introduction"></a>
## Introduction: Topic (5 mins)

Since we're starting to get pretty comfortable with using pandas to do EDA, let's add a
couple more tools to our toolbox.

The main data types stored in pandas objects are float, int, bool, datetime64, datetime64, timedelta,
category, and object.

`df.apply()` will apply a function along any axis of the DataFrame. We'll see it in action below.

`pandas.Series.value_counts` returns Series containing counts of unique values. The resulting
Series will be in descending order so that the first element is the most frequently-occurring
element. Excludes NA values.

- Examples of [dtypes](http://pandas.pydata.org/pandas-docs/stable/pandas.pdf).
- Examples of [value_counts](http://nullege.com/codes/search/pandas.Series.value_counts).

<a name="Inspect data types "></a>
## Demo /Guided Practice: Inspect data types  (20 mins)

Let's create a small dictionary with different data types in it.

In [61]:
import pandas as pd
import numpy as np
dft = pd.DataFrame(dict(A = np.random.rand(3),
                        B = 1,
                        C = 'foo',
                        D = pd.Timestamp('20010102'),
                        E = pd.Series([1.0]*3).astype('float32'),
                        F = False,
                        G = pd.Series([1]*3,dtype='int8')))
dft

          A  B    C          D    E      F  G
0  0.921297  1  foo 2001-01-02  1.0  False  1
1  0.402638  1  foo 2001-01-02  1.0  False  1
2  0.549109  1  foo 2001-01-02  1.0  False  1

There is a really easy way to see what kind of dtypes are in each column.

In [62]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

If a pandas object contains data multiple dtypes IN A SINGLE COLUMN, the dtype of the
column will be chosen to accommodate all of the data types (object is the most general).

In [63]:
# these ints are coerced to floats
pd.Series([1, 2, 3, 4, 5, 6.])

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [64]:
# string data forces an ``object`` dtype
pd.Series([1, 2, 3, 6., 'foo'])

0      1
1      2
2      3
3    6.0
4    foo
dtype: object

The method `DataFrame.dtypes.value_counts()` will return the number of columns of each type in a DataFrame:

In [65]:
dft.dtypes.value_counts()

float64           1
int64             1
object            1
datetime64[ns]    1
float32           1
bool              1
int8              1
dtype: int64

You can do a lot more with dtypes that you can check out [here](http://pandas.pydata.org/pandas-docs/stable/pandas.pdf).

**Check:** Why do you think it might be important to know what kind of dtypes you're working with?

<a name=" df.apply()"></a>
## Demo /Guided Practice:  df.apply() (20 mins)

Let's create a small data frame.

In [66]:
df = pd.DataFrame(np.random.randint(0 , 10, (5, 4)), columns=['a', 'b', 'c', 'd'])
df

   a  b  c  d
0  2  6  4  6
1  2  3  3  4
2  1  6  0  0
3  6  2  3  0
4  5  2  6  1

Use `df.apply` to find the square root of all the values.

In [67]:
df.apply(np.sqrt)

          a         b         c        d
0  1.414214  2.449490  2.000000  2.44949
1  1.414214  1.732051  1.732051  2.00000
2  1.000000  2.449490  0.000000  0.00000
3  2.449490  1.414214  1.732051  0.00000
4  2.236068  1.414214  2.449490  1.00000

Find the mean of all of the columns.

In [68]:
df.apply(np.mean)

a    3.2
b    3.8
c    3.2
d    2.2
dtype: float64

Find the mean of all of the rows.

In [69]:
df.apply(np.mean, axis=1)

0    4.50
1    3.00
2    1.75
3    2.75
4    3.50
dtype: float64

[df.apply](https://gist.github.com/why-not/4582705)
[df.apply](http://chrisalbon.com/python/pandas_apply_operations_to_dataframes.html)

**Check:** How would find the std of the columns and rows?

<a name=".value_counts()"></a>
## Demo /Guided Practice: .value_counts() (20 mins)

Let's create a random array with 50 numbers, ranging from 0 to 7.

In [70]:
data = np.random.randint(0, 7, size = 50)
data

array([5, 0, 2, 2, 4, 5, 4, 0, 2, 1, 5, 6, 3, 6, 5, 1, 6, 0, 1, 3, 2, 3,
       6, 5, 3, 0, 3, 2, 0, 3, 2, 5, 2, 1, 0, 3, 0, 5, 1, 6, 3, 1, 2, 2,
       2, 5, 2, 5, 3, 3])

Convert the array into a series.

In [71]:
data = pd.Series(data)
data

0     5
1     0
2     2
3     2
4     4
5     5
6     4
7     0
8     2
9     1
10    5
11    6
12    3
13    6
14    5
15    1
16    6
17    0
18    1
19    3
20    2
21    3
22    6
23    5
24    3
25    0
26    3
27    2
28    0
29    3
30    2
31    5
32    2
33    1
34    0
35    3
36    0
37    5
38    1
39    6
40    3
41    1
42    2
43    2
44    2
45    5
46    2
47    5
48    3
49    3
dtype: int32

How many of each number is there in the series? Enter `value_counts()`:

In [72]:
data.value_counts()

2    11
3    10
5     9
0     7
1     6
6     5
4     2
dtype: int64

<a name="ind-practice"></a>
## Independent Practice: Topic (20 minutes)
- Use the [sales.csv data set](./assets/datasets/sales_info.csv) - we've seen this a few times in previous lessons!
- Inspect the data types
- You've found out that all your values in column 1 are off by 1, add 1 to column 1 of the dataset
- Use .value_counts to count the values of 1 column of the dataset

**Bonus**
- Add 3 to column 2
- Use .value_counts for each column of the dataset